app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
    @sort=params[:sort]
    @movies=Movie.order(params[:sort])
    @all_ratings=['G','PG','PG-13','R']


    if(params[:ratings]!=nil)
      @keys=params[:ratings].keys
      @movies=Movie.find_all_by_rating(@keys)
---
SELECT "movies".* FROM "movies" WHERE (rating = 'PG','PG-13')
SELECT "movies".* FROM "movies" WHERE "rating"."PG-13" = 'PG-13' AND "rating"."R" = 'R'
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R') ORDER BY release_date